000_РОЗНИЦА_ЦЕНТР/src/Documents/РаспоряжениеНаПриемку/РаспоряжениеНаПриемку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспоряжениеНаПриемку</name>
  <registerRecords>InformationRegister.РекламныеМатериалы</registerRecords>
  <registerRecords>AccumulationRegister.РекламныеМатериалыКПриемке</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НеТребуетПриемки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиРекламныхМатериалов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РекламныеМатериалы</name>
    <attributes>
      <name>РекламныйМатериал</name>
      <type>
        <types>CatalogRef.РекламныеМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламнаяПлоскость</name>
      <type>
        <types>CatalogRef.РекламныеПлоскости</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаКВМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/РекламныеПлоскости/РекламныеПлоскости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РекламныеПлоскости</name>
  <owners>Catalog.Магазины</owners>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРекламныхПлоскостей</name>
    <type>
      <types>CatalogRef.ВидыРекламныхПлоскостей</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.РекламныеПлоскостиПрисоединенныеФайлы</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Documents/РаспоряжениеНаПриемку/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Организация) тогда 	
		Объект.Организация = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику().ОсновнаяОрганизация; 
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Магазин) тогда 	
		Объект.Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин; 
	КонецЕсли;

	УправлениеДоступомРТ.ПриСозданииФормыНаСервере(ЭтотОбъект);	//	LNK 17.10.2019 14:30:01
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
	РасчитатьКоличествоДней()
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
	РасчитатьКоличествоДней()
КонецПроцедуры


&НаКлиенте
Процедура РасчитатьКоличествоДней()
	Если ЗначениеЗаполнено(Объект.ДатаС) и  ЗначениеЗаполнено(Объект.ДатаПо) тогда		
		КоличествоДней = (Объект.ДатаПо - Объект.ДатаС)/(24*60*60) + 1;
	Иначе
		КоличествоДней = 0;
	КонецЕсли;
	ПересчитатьНаСервере(КоличествоДней);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РасчитатьКоличествоДней()
КонецПроцедуры

&НаКлиенте
Процедура РекламныеМатериалыКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.РекламныеМатериалы.ТекущиеДанные;
	ПересчитатьСумму(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура РекламныеМатериалыЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.РекламныеМатериалы.ТекущиеДанные;
	ТабРеквезиты = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ТекДанные.РекламнаяПлоскость,"Ширина,Высота");
	Если НЕ ТабРеквезиты.Ширина*ТабРеквезиты.Высота = 0 тогда  
		ТекДанные.ЦенаЗаКВМ = ТекДанные.Цена/(ТабРеквезиты.Ширина*ТабРеквезиты.Высота)*30;
	КонецЕсли;	
	ПересчитатьСумму(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму(ТекДанные)
 ТекДанные.Сумма = ТекДанные.Количество*ТекДанные.Цена*КоличествоДней;	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьНаСервере(КоличествоДней)
	Для Каждого Строка из Объект.РекламныеМатериалы цикл
		Строка.Сумма = Строка.Количество * Строка.Цена * КоличествоДней;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РекламныеМатериалыЦенаЗаКВМПриИзменении(Элемент)
	ТекДанные = Элементы.РекламныеМатериалы.ТекущиеДанные;
	ТабРеквезиты = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ТекДанные.РекламнаяПлоскость,"Ширина,Высота");
	ТекДанные.Цена = ТекДанные.ЦенаЗаКВМ*ТабРеквезиты.Ширина*ТабРеквезиты.Высота/30;
	ПересчитатьСумму(ТекДанные);
КонецПроцедуры

&НаСервере
Процедура МагазинПриИзмененииНаСервере()
	Для Каждого Строка из Объект.РекламныеМатериалы цикл
		Строка.РекламнаяПлоскость = Справочники.РекламныеПлоскости.ПустаяСсылка();
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура МагазинПриИзменении(Элемент)
	МагазинПриИзмененииНаСервере();
КонецПроцедуры
